/*
Navicat MySQL Data Transfer
Source Server         : mysql80
Source Server Version : 80036
Source Host           : localhost:3306
Source Database       : product
Target Server Type    : MYSQL
Target Server Version : 80036
File Encoding         : UTF-8
Date: 2026-01-12 14:34:59
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- 创建数据库
-- ----------------------------
CREATE DATABASE IF NOT EXISTS `product`
    CHARACTER SET utf8mb4
    COLLATE utf8mb4_unicode_ci;

USE `product`;

-- ----------------------------
-- Table structure for `product`
-- ----------------------------
DROP TABLE IF EXISTS `product`;
CREATE TABLE `product` (
                           `id` bigint NOT NULL AUTO_INCREMENT COMMENT '产品ID',
                           `name` varchar(255) NOT NULL COMMENT '产品名',
                           PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='产品表';

-- ----------------------------
-- Records of product
-- ----------------------------
INSERT INTO `product` (`id`, `name`) VALUES
                                         (1, '产品1'),
                                         (2, '产品2'),
                                         (3, '产品3'),
                                         (4, '产品4'),
                                         (5, '产品5'),
                                         (6, '产品6'),
                                         (7, '产品7'),
                                         (8, '产品8'),
                                         (9, '产品9'),
                                         (10, '产品10'),
                                         (11, '产品11'),
                                         (12, '产品12'),
                                         (13, '产品13'),
                                         (14, '产品14'),
                                         (15, '产品15'),
                                         (16, '产品16'),
                                         (17, '产品17'),
                                         (18, '产品18'),
                                         (19, '产品19'),
                                         (20, '产品20'),
                                         (21, '产品21'),
                                         (22, '产品22'),
                                         (23, '产品23'),
                                         (24, '产品24'),
                                         (25, '产品25'),
                                         (26, '产品26'),
                                         (27, '产品27'),
                                         (28, '产品28'),
                                         (29, '产品29'),
                                         (30, '产品30'),
                                         (31, '产品31'),
                                         (32, '产品32'),
                                         (33, '产品33'),
                                         (34, '产品34'),
                                         (35, '产品35'),
                                         (36, '产品36'),
                                         (37, '产品37'),
                                         (38, '产品38'),
                                         (39, '产品39'),
                                         (40, '产品40'),
                                         (41, '产品41'),
                                         (42, '产品42'),
                                         (43, '产品43'),
                                         (44, '产品44'),
                                         (45, '产品45'),
                                         (46, '产品46'),
                                         (47, '产品47'),
                                         (48, '产品48'),
                                         (49, '产品49'),
                                         (50, '产品50'),
                                         (51, '产品51'),
                                         (52, '产品52'),
                                         (53, '产品53'),
                                         (54, '产品54'),
                                         (55, '产品55'),
                                         (56, '产品56'),
                                         (57, '产品57'),
                                         (58, '产品58'),
                                         (59, '产品59'),
                                         (60, '产品60'),
                                         (61, '产品61'),
                                         (62, '产品62'),
                                         (63, '产品63'),
                                         (64, '产品64'),
                                         (65, '产品65'),
                                         (66, '产品66'),
                                         (67, '产品67'),
                                         (68, '产品68'),
                                         (69, '产品69'),
                                         (70, '产品70'),
                                         (71, '产品71'),
                                         (72, '产品72'),
                                         (73, '产品73'),
                                         (74, '产品74'),
                                         (75, '产品75'),
                                         (76, '产品76'),
                                         (77, '产品77'),
                                         (78, '产品78'),
                                         (79, '产品79'),
                                         (80, '产品80'),
                                         (81, '产品81'),
                                         (82, '产品82'),
                                         (83, '产品83'),
                                         (84, '产品84'),
                                         (85, '产品85'),
                                         (86, '产品86'),
                                         (87, '产品87'),
                                         (88, '产品88'),
                                         (89, '产品89'),
                                         (90, '产品90'),
                                         (91, '产品91'),
                                         (92, '产品92'),
                                         (93, '产品93'),
                                         (94, '产品94'),
                                         (95, '产品95'),
                                         (96, '产品96'),
                                         (97, '产品97'),
                                         (98, '产品98'),
                                         (99, '产品99'),
                                         (100, '产品100'),
                                         (101, '对大着火状使'),
                                         (102, '商品102');
